{"votes": {"funny": 8, "useful": 12, "cool": 10}, "user_id": "gzJpPaHN-NXBkAZcZri3hw", "review_id": "Yykz_Z6E1koL6Ef83cOgQQ", "stars": 5, "date": "2014-07-15", "text": "Oh my gosh! We got to see Wayne's World! FilmBar is one of my favorite places to grab a drink. And now I've finally seen a movie there! It's a wonderful theatre with a retro vibe. You can't beat having a bar right in the lobby! (Priorities, I have them.)\n\nFilmBar was oh-so-very-graciously generous. I used my drink ticket to enjoy a wonderful Malbec. Fancy!\n\nI stuffed 'ma belly right before the show with Short Leash heavenly food. (Thanks for the tasty nibbles to sample!) The jalapeño popper was right up my alley. \n\nI had *no* idea the regular 'dogs were So. BIG. Bejeebers. And yet I managed to 95% finish my Aiko (complete with gooey mango chutney, jalapeños, red onions, cilantro and mayo). I love how they have a standard menu, but, also allow you to custom build a 'dog. Next time Irene PACE YOURSELF. \n\nFabulous fun event! I can't wait to return to catch another Staff Pick in the July series. Thank you Film Bar! Thank you Short Leash! Thank you Lindsey!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "LI84TDkSPQ25oAbySweIJg", "stars": 5, "date": "2014-07-15", "text": "That was awesome!\n\nShow up, see some friends, have samples from Short Leash, order dinner from Short Leash, get a nice cold cider, see a movie. And what a fun surprise - Wayne's World! So many scenes brought back great memories - and a couple of great moments I'd completely forgotten about.\n\nI love the concept - show up and see a surprise movie - all we know is it was at least partially filmed in AZ.\n\nLots of good guesses - lots of audience participation - LOTS of fun!\n\nThank you FilmBar and Short Leash and Lindsey! A great evening out - and I can't wait to do it again!\n\nI'd never been to FilmBar before - and definitely look forward to heading back - what a great venue!  Always nice to see a movie I wouldn't get to see anywhere else - and a decent selection of wine and solid selection of beer to enjoy while watching the movie? SCORE! Several upcoming movies I'm looking forward to checking out here.", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "lYb2U5Y-Szs9X5UqX6_xpw", "stars": 5, "date": "2014-07-15", "text": "What a wonderful idea for a monthly film series at a wonderful local cinema. I was transported right back to NY and the original movie theaters of my childhood. Well, all except the fact this one has a bar, a cool lounge, and some great art hanging on the walls. lol. I had never been here before so was very happy to score an invite. My \"Plus One friend\" loves it here so she was raring to go. I adore the Roosevelt Row area so much so we added this to the really cool things to do in Downtown. Bonus points for eating at Trumpets Ale before the gig. Two new places in one night on Roosevelt Row spells awesomeness. \n\nWe tried all day to guess which \"surprise, locally filmed movie\" they were going to show. I kept guessing \"Raising Az\" because it is the SunDevil in me. CG hates that one. We sparred all day. I crossed my fingers she wouldn't just walk out if they played that one. All her picks were awesome too! We hope to see any of them in the next few months as Yelp picks. Surprisingly, it was really exciting to go to a theater when you had no idea what movie was going to be shown until the credits started flowing. ( I see this as a new home movie party trend)  Az has a long history of movie magic and we had over 200 films to chose from. We were all on the edge of our seats. When the first words to pop up were \"A Lorne Michaels Film\" We heard a loud, \"WOOP!\" from some fellow Rowdy Yelpers.  I still did not know which SNL film it was until the title popped up. I was pretty surprised. I thought I knew most of the films on the local list but forgot about Wayne's World. Lol-- how funny. I relived some of my eighties college music days and definitely those hair band experiences growing up on Long Island listening to Metal/Rock groups like; Zebra, Alice Cooper, and Poison. (Just to name a few)  \n\nWe had a great time tonight. We can not wait to go back. Coincidentally, I had just watched \"World's End\" last night. FilmBar is having a \"Shaun of the Dead\" party on the 25th. I think I heard something about a Zombie Pinata, and that dressing up party Shenanigans were predicted to ensue. Yes, please. Thanks Lindsey and Filmbar Gang for bringing back my \"College, \"EH-Hem,\" I mean \"Ballroom-- Blitz\" drama days.", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "7qqYswBRx0yqP0Du_9xlDg", "stars": 5, "date": "2014-07-16", "text": "Really enjoyed drinking wine and watching Wayne's World last night.  I can't wait to go and enjoy another movie at The FilmBar. It was comfortable and inviting and such a cool set-up!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H_JsAwjiGEOr_RlZmwfNsA", "review_id": "7j9DJ0R2ys9N7PB2hZdceQ", "stars": 5, "date": "2014-07-16", "text": "WAYNE'S WORLD! WAYNE'S WORLD! Party time! Excellent!\n\nWhat a great movie choice for the first Yelp Secret Cinema! We laughed our butts off at Film Bar in a fun private showing of the 90s classic Wayne's World! \n\nThe event was as casual as a Tuesday evening, but way more fun! We had dinner from Short Leash Dogs and a free drink on the house! I went for the chicken dog and added some of my favorite toppings and a sweet pear cider. \nNow, I was all set for the movie! \n\nLindsey wouldn't tell us the movie before it started. Duh it was a secret! We sat in suspense for a minute, but when the opening credits started many Yelpers had a clue! It's funny, my plus one (Leigh C.) had NEVER seen Wayne's World before. She was just a tot when the movie was popular and it was hilarious to see a person watch Wayne's World for the first time! Good pick! \n\nParty on Yelp!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 4, "useful": 5, "cool": 6}, "user_id": "XTFE2ERq7YvaqGUgQYzVNA", "review_id": "OO6prfuGEMalQcQcU3WCaw", "stars": 5, "date": "2014-07-16", "text": "Fab concept:\n\n- Test out a new (well, new for me, as I hadn't been to Film Bar previously) independent cinema\n- Get your drink on with a generously gratis beer or wine of my choosing\n- Short Lease Hot Dogs oh-so-conveniently parked outside.  Plus....samples of their appetizers?  Heck to the yes!\n\nAdd in the excitement and anticipation of not knowing what filmed-in-AZ movie was going to be shown, and you have a perfect weeknight event!\n\nNow that I know the movies don't actually have to be \"based\" in Arizona, i have some awesome ideas of what may be next.\n\nAnd not to mention some great Filmbar date ideas should my online dating attempts pan out :)\n\nThanks Film Bar, Yelp, Short Lease and my fun fellow Yelpers for a great time!\n\nPS - Where do we get the post-movie trivia answers??", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "2fPxXAysOrZLrahZQyJCNg", "stars": 5, "date": "2014-07-16", "text": "Wayne's World....Short Leash...at the FilmBar.  Need I say more?\n\nThis was a great Tuesday night adventure.  Wayne's World took me waaaaaay back and I had not had my favorite Aiko with a chicken dog from Short Leash in ages!  \n\nGreat Yelp coordinated outing as usual! Thanks Lindsey and the Yelp crew. \n\nThanks Kelly A and his staff at the FilmBar.  This place it the bomb any day of the week. \nThanks Brad and Kat and their Short Leash bunch for having your trailer available for the event.", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hdZ3rlgFXctCOUhzoOebvA", "review_id": "XXblLOSqYlq0tXhxHfXUHQ", "stars": 4, "date": "2014-07-16", "text": "Great Time!! Funny movie!! Loved going to the Film Bar for the first time! The tables so you can eat are fantastic!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "k2u1F6spBGhgk2JtAe97QA", "review_id": "HeDqdFYkKaeDvPtiFy6Xmw", "stars": 5, "date": "2014-07-16", "text": "This event was my favorite event in a long time. Lindsey did a fabulous job of setting all of this up and keeping the movie to be played completely hush hush. I absolutely love FilmBar. They always have a great beer and wine selection, wonderful staff, and a wacky selection of art film. The movie for the night was Wayne's World, one of my all-time favorites. So naturally I was beyond thrilled to have been invited. Had a super \"Foxey\" date, (Can you say that about a guy?) and a delicious dog from Short Leash, and a fabulous time. \n\nThank you Lindsey, FilmBar, and Yelp for a fantastic evening! Party time, excellent!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wy8Yd_vCWDjiz9rMo4HfqA", "review_id": "g8CIKUaosLDS3Vg7VLognA", "stars": 5, "date": "2014-07-16", "text": "What a horrible time yesterday... shYEAH - and monkeys might fly out of my butt!  As always, Lindsey's event went off without a hitch.  It was great to see a few fellow yelpers I knew, and a few more I had not yet met.  Immediately arrived to a drink ticket, Short Leash was outside (c'mon, they rock) and we were all kind of excited to watch a movie with one another.\n\nThe previews were great, the service was great, and I was excited when the title came up - as it had been at least 20 years since I've seen Wayne's World!  I had forgotten how many hilarious lines / scenes were in it that I still quote today.  Bravo - what a great time and can't wait for the next one!\n\np.s. this was my first time visiting Film Bar - and I will most definitely be back, I love the vibe there and they show some pretty sick cult classic type movies there.  Plus, the beer selection is better than you'd expect for a movie theater!", "type": "review", "business_id": "nYer89hXYAoddMEKTxw7kA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AnH84g9V10x41CXmCvcaFg", "review_id": "4ffWpUCyITEgZEGGyZWhbA", "stars": 5, "date": "2014-07-10", "text": "My new favorite restaurant.  They have 22 different fish dishes ranging from $16-23, at least a dozen different kinds of pizza slices ready for you to pick out of the case, soups, salads, and 15 kinds of pasta that they will serve with any of 4-6 different sauces.  The food is so yummy!  I rate it 5 stars because the menu is huge, it fits a niche market that is in need of more restaurants, the people are warm and friendly, food is all freshly prepared but the wait is not long, and it is reasonably priced.", "type": "review", "business_id": "BMjggIgOghBMEXPo8q7q3w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pslJujFe9XO28lMm8izNtg", "review_id": "vZVRzaoK2Z6C0-pd0YV9nw", "stars": 5, "date": "2014-07-16", "text": "GreAt food awesome service . The best fish in town . Must go and check it out . The menu will blow your mind . Way too much to choose . They have something for everyone .", "type": "review", "business_id": "BMjggIgOghBMEXPo8q7q3w"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ZVkaYRCTFSSt-Ch9uwigOQ", "review_id": "FOIB5Cx_iIY-FWKMH45VRw", "stars": 5, "date": "2014-07-16", "text": "Walking into this place looks nice and well kept. I liked the setup they have. I'm giving this place five star rating not for how nice and casual it is but for the food. I haven't tried everything on the menu yet, but I will that's my plan in the near future. I have had at least five items from the menu so far and I got hooked.  It all tasted to what I expected it to and I'm glad for that because there isn't a lot of kosher restaurants out here, so it's nice to know I can get kosher food in a restaurant and enjoy it. The menu selections are awesome a lot to choose from, so there's something for everybody that loves to eat from pastas to pizzas and so on. By the way this place is dairy only. Give them a try you will enjoy it.", "type": "review", "business_id": "BMjggIgOghBMEXPo8q7q3w"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lhMo-dGq0V2iKqBIiwUJSg", "review_id": "eujuvkGqy2ssZ9zjdPJrMA", "stars": 5, "date": "2010-08-11", "text": "Located at the bottom of Lauriston Place, this tiny supermarket (with the kind of hilariously specific name) has loads of interesting dried mushroom, loads of seaweeds, 35p for a bag of beansprouts, really cheap tofu, a million different kinds of rice and noodles...\n\nIt's also a vegetarian haven in that they have loads of cheap mock meat (for when you're feeling strange), for example fake prawns (great for tempura). Though they also have strange kind of disgusting looking canned meat. I haven't properly investigated the travel agent part, though it makes me giggle quite a bit, but the supermarket is definitely the place to go if you want to have a sushi party and feed a thousand people for under a tenner.", "type": "review", "business_id": "BVxlrYWgmi-8TPGMe6CTpg"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "TTrzXCtB2MZA8Azw56bRlw", "review_id": "vFA5KXUGEH-oMcM6WTC-8w", "stars": 5, "date": "2012-06-15", "text": "I love this place! I think the staff struggle to understand what I am looking for sometimes, but they are super helpful!1st time I went in here I spent about 30mins just wondering around looking at all the mental stuff they had.... like the poster below I am vegetarian too, so I had to try all the crazy mock meat (fake duck anyone?) & almost every time I go I come out with something new to try. Prices are good, they offer a small student discount too (5%, but every little helps!)  . A couple of times i've been they have run out of the one thing I am after but usually they are well stocked in most of their items! Defiantly worth a look, if just to see all the awesome different foods out there!", "type": "review", "business_id": "BVxlrYWgmi-8TPGMe6CTpg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rtS7mDof5d-cEPBsmVuUJw", "review_id": "0sVK4VUxvj3cy78W0DlvWQ", "stars": 3, "date": "2013-09-17", "text": "Perfect little shop to go to if you want to pick up some Asian food real fast. Has a little bit of everything in terms of fresh veggies, Asian cutlery and dishes, rices, and frozen goods. I usually stop in here to pick up simple stuff like soy sauce and nori. They do carry a good selection of ramen for those lazy days when you don't want to cook or just need some comfort food, which ramen does for me. I also noticed they have a selection of Sake! I feel like sake is quite hard to come by in this country and they have a little variety . There is also a little fridge that carries all your favourite Asian soft drinks. Best of all, and that I always forget to ask for, is they have a 10% student discount . The prices are already not that bad so it's a good deal. Every time I come here the staff are also super nice , not fake nice but I feel genuinely nice which always makes your day. Best of all I love the original name of this place :D", "type": "review", "business_id": "BVxlrYWgmi-8TPGMe6CTpg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "tZs84cKAUSOtP_nAiSdreQ", "review_id": "Nx88b_tCsP7Oja3PvhR5tQ", "stars": 4, "date": "2013-09-18", "text": "I visit here once or twice a month. Just to get the Asian cooking essentials that cannot be found anywhere else. They have a proper selection of peanut / satay sauce and a good frozen Bah Pao. They are not hugely stocked int he front part of the shop, but you can always ask the lady behind the counter to find it in the back. \n\nThey're very helpful in choosing the right ingredients and even shared a few recipes ideas with me.\n\nThey serve the area well as there are not many Asian shops in that neighbourhood. Sure for more choices go to Leith walk, but here they hold their own.", "type": "review", "business_id": "BVxlrYWgmi-8TPGMe6CTpg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LfnB4N7SVSAIPOM3If_kDA", "review_id": "p2KCsYuLHDtXqh1BpR9dGQ", "stars": 3, "date": "2013-12-17", "text": "I like this place to pick up a few odds and ends now and again. Mainly when I have forgotten some exotic ingredient or other. The staff are friendly the shop well laid out but it doesnt gel with me as much as the shops in newington and leith. One of the main reasons is that it can be quite expensive for some items that can be had for half price else where.", "type": "review", "business_id": "BVxlrYWgmi-8TPGMe6CTpg"}
